Revit 2026 API

# PlasticvinylBumpType Enumeration

---

The enumerated type representing the permitted values for the asset property "PlasticvinylBump" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PlasticvinylBumpType
```
```vb
Public Enumeration PlasticvinylBumpType
```
```cpp
public enum class PlasticvinylBumpType
```
```fsharp
type PlasticvinylBumpType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace